Repository: chr233/ASFTradeExtension
Catalog: ASFTradeExtension/Localization/Langs.*.resx
Languages: ru_ru

# CartEmptyResponse
source: Response is empty
ru_ru: Пустой ответ

source: Network Error
ru_ru: Сетевая ошибка

source: Error
ru_ru: Ошибка

# PluginContact
source: Developed by Chr_, email chr@chrxw.com
ru_ru: Разработано Chr_, email chr@chrxw.com

source: Success
ru_ru: Успех

source: Done
ru_ru: Готово

source: Multiple line result:
ru_ru: Результат с несколькими строками:

# CurrentLanguage
source: en-US
ru_ru: ru-RU

# CleanUpOldBackup
source: Clear the old plugin's backup file success
ru_ru: Успешная очиститка старых бекапов плагина

# CleanUpOldBackupFailed
source: Clear the old plugin's backup file failed
ru_ru: Не удалось очистить старые бекапы плагина

# PluginVer
source: {0} Version {1}
ru_ru: {0} Версия {1}

# EulaWarning
source: {0}: ASFEnhance.EULA not agreed, some features is disabled
ru_ru: {0}: "ASFTradeExtension.EULA" не принят, некоторые функции отключены

# AppIdInvalid
source: Invalid AppId
ru_ru: Неверный AppId

# ArgumentInvalidAppIds
source: Input argument AppIds Invalid
ru_ru: Параметр неверный

# ArgumentInvalidFSL
source: Invalid argument, Example: -p 2 -l 20 (second page, 20 entries per page)
ru_ru: Неправильный параметр, пример: -p 2 -l 20 (вторая страница, 20 предмет на странице)

# ArgumentInvalidSCS
source: Invalid argument, Example: 730 2 Trade link
ru_ru: Недопустимый параметр, пример: 730 2 Ссылка на трейд

# ArgumentInvalidSCS2
source: AppId and SetCount must be above 0
ru_ru: AppId и SetCount должны быть больше чем 0

source: Card inventory is empty
ru_ru: В инвентаре отсутствуют карточки

# CurrentCardInventoryShow
source: {0}: Total {1} cards, {2} cards per set, Total {3} sets + {4} cards, Tradeable {5} sets + {6} cards
ru_ru: {0}: 总计 {1}张, 每套 {2}张, 可交易 {3}套 +{4}张, 不可交易 {5}套 +{6}张

source: Failure
ru_ru: Неудачно

# InventoryStatusBeforeTrade
source: Pre-trade inventory status:4
ru_ru: Состояние инвентаря до совершения операции:

# LoadInventoryFailedNetworkError
source: Failed to read inventory information due to network error
ru_ru: Не удалось считать информацию инвентаря из-за сетевой ошибки

# SendTradeResult
source: Trade offer sent {0}
ru_ru: Трейд отправлен {0}

source: SteamId Invalid
ru_ru: Неверный SteamId

# SendTradeFailedAppIdInvalid
source: Failed to send trade, AppId may not be valid
ru_ru: Не удалось отправить трейд, AppId может быть не верным

# SendTradeFailedNoEnoughCards
source: Failed to send trade offer, not enough cards available for trade
ru_ru: Не удалось отправить трейд, недостаточное количество карт для обмена

source: No information
ru_ru: Информация отсутствует

# ExpectToSendCardInfo
source: Expected to send {0} sets, total {1} cards
ru_ru: Предполагаемое количество ожидаемых отправления наборов {0}, всего карточек {1}

# SendCsItemArgsTips
source: Arguments are invalid SENDCSITEM [Bots] [ClassId] Number of items to be sent to each Bot, if ClassId is not specified, all tradable items will be sent, otherwise only the specified items will be sent
ru_ru: Неверный SENDCSITEM [Bots] [ClassId] Количество предметов для отправки каждому боту, если ClassId не указан, то будут отправлены все доступные для торговли/обмена предметы, в противном случае будут отправлены только указанные предметы

# SellCsItemArgsTips
source: Arguments are invalid SELLCSITEM ClassId Quantity Price, Sell All if Quantity is -1
ru_ru: Параметр SELLCSITEM недействителен [BotNames] [ClassId] , если ClassId не указан, то все элементы будут выставленны на продажу, Продать все, когда ClassId равен -1

# DeListingSuccess
source: Successfully cancelled {0} items
ru_ru: Успешно убрано {0} предметов выставленнных на торговой площадке

# CsMarketHistoryArgsTips
source: Arguments are invalid SENDCSITEM [BotNames] [ClassId] Number of items to be sent to each Bot, if ClassId is not specified, all tradable items will be sent, otherwise only the specified items will be sent
ru_ru: Параметр CSMARKETHISTORY недействителен [BotNames] [ClassId] , если ClassId не указан, то все элементы будут выставленны на продажу

# CsDeListingItemArgsTips
source: Arguments are invalid CSDELISTING [BotNames] [ClassId], if no ClassId is specified, all items will be removed from the market
ru_ru: Параметр CSDELISTING недействителен [BotNames] [ClassId], если ClassId не указан, то все элементы будут выставленны на продажу

# FetchTradeLinkFailed
source: Failure to automatically fetch trading links
ru_ru: Ошибка автоматического получения ссылки на трейд

source: Invalid ClassId
ru_ru: Неверный ClassId

# ItemListingSuccess
source: Total {0} items listed {1}
ru_ru: Всего {0} предметов, выставленных на продажу {1}

# ItemListSuccessWaitConfirm
source: Total {0} items listed, awaiting manual confirmation
ru_ru: >Всего {0} предметов, выставленных на продажу, Ожидание 2FA подтверждения

# TFAConfirmResult
source: 2FA auto-confirmation {0}
ru_ru: Подтверждение 2FA {0}

# ThreeItemWithNum
source: {0} {1} Quantity {2}
ru_ru: {0} {1} Количество {2}

# NoSelingCsItemInFilter
source: No CS2 items available for sale with current filters
ru_ru: Отсутствие предметов CS2 которые доступны для продажи с текущими фильтрами

# NoSellingCsItem
source: No CS2 items for sale
ru_ru: Отсутствие предметов CS2 которые доступны для продажи

# ASFEnhanceRegisterFailed
source: ASFEBridge registration failed
ru_ru: Не удалось зарегистрировать ASFEBridge

# ASFEnhanceRegisterSuccess
source: ASFEBridge registration successful
ru_ru: Регистрация ASFEBridge прошла успешно

# PluginStandalongMode
source: Recommended to install ASFEnhance, support for automatic update plug-ins
ru_ru: Мы рекомендуем установить плагин ASFEnhance, поддерживающий автоматическое обновление.

# NoAvilableCards
source: No available cards
ru_ru: Карточки отсутствуют

# NoAvilableItemToShow
source: Nothing to display under current settings
ru_ru: При текущих настройках ничего не отображается

# NoBotsAvilable
source: No available bots
ru_ru: Нет доступных ботов

# SendTradeFailedNoItemAvilable
source: Send trade offer {0} -> {1} Failed, no items available
ru_ru: 发送交易报价 {0} -> {1} 失败, 无可用物品
